using System;

namespace преобразъване_2_8_18
{
    class Program
    {
        static void Main(string[] args)
        {
            //преобразуване на числото 2088 в двуична бройна система 
            //2088/2=1044 ->0
            //1044/2=522  ->0    
            //522/2=261   ->0
            //261/2=130,5 ->1
            //130/2=65    ->0
            //65/2=32,5   ->1
            //32/2=16     ->0
            //16/2=8      ->0
            //8/2=4       ->0            
            //4/2=2       ->0
            //2/2=1       ->0
            //1/2=0       ->1
            //подреждаме ги от послето към първото,като така се получава числото в двуична бройна сиситема 100000101000(2)

            //преминаване от десетична в осмична бройна система
            //2088/8=261  ->0
            //261/8=32,6  ->6
            //32/8=4      ->0
            //4/8=0,5     ->5
            //подреждаме ги от послето към първото,като така се получава числото в осмична бройна сиситема 5060(8)

            //преминаване от десетична в шестнайсетична бройна система
            //2088/16=130,5 ->5
            //130/16=8,125  ->13/d
            //8/16=0,5      ->5
            //подреждаме ги от послето към първото,като вместо 13 поставяме буквата d и така се получава числото в шестнайсетична бройна сиситема 5d5(16)
        }
    }
}
